# a. for (i = n; i > 1; i /= 2)
#  		db_call()
#
# підходить, зробимо порядку n/2 викликів, що меньше n^2
# не підходить, нескінченний цикл, більше n^2 запитів


# b. for (i = 0; i * i < n; i++)
# 		db_call()
#
# підходить, зробимо порядку n^2 викликів, що меньше n^2
# підходить, зробимо порядку log n викликів, що меньше n^2


# c. for (i = 0; i < n; i++)
# 	  	for (j = 0; j < 356; j++)
# 		  db_call()
#
# підходить, сладність лінійна, зробимо порядку n * 356 викликів, що меньше n^2


# d. for (i = 1; i <= n * n - 10; i++)
# 		for (j = 1; j <= i; j ++)
# 			db_call()
#
# не підходить, складність експоненційна, зробимо порядку n^3 / 2 викликів
#
# 1) при i=1, виконається 1 раз, при i=1, 2 рази і так далі. При останній ітерації алгоритм виконається n^2-10 раз
# 2) знаходимо суму 1 + 2 + 3 + 4 + 5 + ... + n^2-10
# 3) знайдемо більшу границю замінивши всі члени на найбільший
# 4) не підходить, складнісь(O) буде в межах n^2-10 < O < n^4 -20n^2 - 100, що більше порядку n^2 запитів

# e.  for (i = 1; i <= n; i++)
# 		for (j = 1; j <= i; j++)
# 			for (k = 1; k <= j; k++)
# 				db_call()
#
# не підходить, складність n^3

# f. for (i = 1; i <= n; i++)
# 		for (j = 1; j < i; j *= 2)
# 			db_call()
#
# g. for (i = 1; i <= n; i++)
# 		for (j = 1; j <= n; j += i)
# 			db_call()
#
# h. void compute(int n)
# 	  if (n == 0) return;
# 	  for (int i = 0; i < n; i++)
# 	  	  db_call()
# 	  compute(n/2)
# 	  compute(n/2)


